# Selenium - фреймворк, кот. в основном используется для кросс-браузерной и кросс-платформенной автоматизации
# взаимодействия с веб-элементами, поддерживает разные ЯП
# WebDriver — это API, независимый от языка интерфейс для управления поведением веб-браузеров.
# Каждый браузер поддерживается определенной реализацией WebDriver, называемой драйвером
# Driver - компонент, отвечающий за делегирование полномочий браузеру, опесп. обмен данными между Selenium и браузером,

# Selenium + WebDriver (код Python) -> Chromedriver (перевод кода в действия) -> Browser (обработка действий)

# Настройка среды (установка venv в pycharm не нужна):
#   pip install selenium
#   pip install packaging
#   pip install webdriver-manager
